DataProcessors/Documents/Расход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Расход</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиДенег</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыПоКатегориям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Documents/Расход/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
    ЗаполнитьКурсНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКурсНаСервере()
    
    Если Объект.Валюта = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Если валюта = RUB, курс = 1
    Если Объект.Валюта.Код = "RUB" Тогда
        Объект.Курс = 1;
        Возврат;
    КонецЕсли;
    
    // Получаем курс из регистра
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Курсы.Курс КАК Курс
    |ИЗ
    |    РегистрСведений.КурсыВалют.СрезПоследних(&Дата) КАК Курсы
    |ГДЕ
    |    Курсы.Валюта = &Валюта";
    
    Запрос.УстановитьПараметр("Дата", Объект.Дата);
    Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Объект.Курс = Выборка.Курс;
    Иначе
        Объект.Курс = 1;
        Сообщить("Курс для валюты " + Объект.Валюта + " не найден! Установлен курс 1.");
    КонецЕсли;
    
КонецПроцедуры

        
&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	   ЛимитыИПредупреждения(); 
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ЛимитыИПредупреждения();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	    ЛимитыИПредупреждения();
КонецПроцедуры

&НаКлиенте
Процедура ЛимитыИПредупреждения() 
	Если НЕ ЗначениеЗаполнено(Объект.Сумма) ИЛИ НЕ ЗначениеЗаполнено(Объект.Категория) ИЛИ НЕ ЗначениеЗаполнено(Объект.Пользователь) Тогда Возврат; КонецЕсли;
	   ЛимитКатегории = ДБ_ОбщегоНазначенияСервер.ПолучитьЛимитКатегории(Объект.Категория);
	    Если ЛимитКатегории = 0 Тогда Возврат; КонецЕсли;
	   РасходЗаМесяц = ДБ_ОбщегоНазначенияСервер.ПолучитьСуммуРасходаЗаМесяц(Объект.Категория, Объект.Пользователь);
	ОбщийРасход = РасходЗаМесяц + Объект.Сумма;
	ОстатокЛимита = ЛимитКатегории - РасходЗаМесяц;
	ПревышениеЛимита = Объект.Сумма - ОстатокЛимита;
		ТекстСообщения = СтрШаблон("Лимит: %1 | Прошлые расходы: %2 | Итого с текущим: %3 | ОСТАТОК: %4", 
		ЛимитКатегории, РасходЗаМесяц, ОбщийРасход, ОстатокЛимита);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения); 
		Если ОстатокЛимита< 0 Тогда
		ПоказатьПредупреждение(,"Внимание! Превышение лимита на " + ПревышениеЛимита);	
	КонецЕсли;
КонецПроцедуры
